Table of Contents
 Class WallRect
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representation of rectangular element2D in IDEA StatiCa Detail
[OpenModelClass(typeof(Wall))]
public class WallRect : Wall, IGeometryPart
Inheritance
object
OpenObject
OpenElementId
Element2D
Wall
WallRect
Implements
IGeometryPart
Inherited Members
 Wall.GeomId
 Wall.MasterComponent
 Wall.MasterPoint
 Wall.InsertPoint
 Wall.Edges
 Wall.Position
 Element2D.Name
 Element2D.Material
 Element2D.GeometricRegion
 Element2D.Thickness
 Element2D.EccentricityZ
 Element2D.InnerLines
 Element2D.InnerPoints
 Element2D.ElementType
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 WallRect()
Coonstructor
public WallRect()
Properties
 Height
Height of wall
public double Height { get; set; }
Property Value
double
 Offset1
Offset horizontal top left
public double Offset1 { get; set; }
Property Value
double
 Offset2
Offset horizontal top left
public double Offset2 { get; set; }
Property Value
double
 Width
Width of wall
public double Width { get; set; }
Property Value
double
 Edit this page